
public class second {

	public static void main(String[] args) {
		//증감 연산자
		//++ 변수의 값을 1증가
		//-- 변수의 값을 1감소
		//피연산자가 앞에 있느냐 뒤에 있느냐에 따라 값이 달라짐
		//++ 피연산자/ -- 피연산자 - 그냥 값을 1 증감소함
		//피연산자 ++ / 피연산자 -- - 다른 연산을 수행한 후에 피연산자의 값을 1증감소함
		//산술 연산자
		//+ - 덧셈, - - 뺄셈, * - 곱셈, / - 나눗셈, % - 나머지
		//비교 연산자
		// == - 값이 같은지, != - 값이 다른지, >, < - 크기가 큰지 작은지 비교, <=, >= - 같은지도 비교
		//논리 연산자
		//&& - 둘다 true인 경우에만 true, || - 둘중에 하나만 true인 경우에도 true,
		//^ - 하나는 true이고 다른 하나가 false인 경우에만 true, ! - true이면 false 반환 false이면 true 반환
		//삼항 조건 연산자
		// 조건식 ? 값또는 연산식(true) : 값또는 연산식(false) 

	}

}
